In [138]:
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
%matplotlib inline

In [4]:
titanic_train = pd.read_csv("https://gist.githubusercontent.com/michhar/2dfd2de0d4f8727f873422c5d959fff5/raw/ff414a1bcfcba32481e4d4e8db578e55872a2ca1/titanic.csv",
                           sep='\t')
titanic_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [5]:
titanic_train.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [6]:
titanic_train.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [7]:
# describes the categorical data
titanic_train.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,156.000000,156.000000,156.000000,126.000000,156.000000,156.000000,156.000000
mean,78.500000,0.346154,2.423077,28.141508,0.615385,0.397436,28.109587
std,45.177428,0.477275,0.795459,14.613880,1.056235,0.870146,39.401047
min,1.000000,0.000000,1.000000,0.830000,0.000000,0.000000,6.750000
25%,39.750000,0.000000,2.000000,19.000000,0.000000,0.000000,8.003150
50%,78.500000,0.000000,3.000000,26.000000,0.000000,0.000000,14.454200
75%,117.250000,1.000000,3.000000,35.000000,1.000000,0.000000,30.371850
max,156.000000,1.000000,3.000000,71.000000,5.000000,5.000000,263.000000

In [10]:
# describing textual data
titanic_train[['Name', 'Sex', 'Ticket', 'Cabin', 'Embarked']].describe()

,Name,Sex,Ticket,Cabin,Embarked
count,156,156,156,31,155
unique,156,2,145,28,3
top,"Ahlin, Mrs. Johan (Johanna Persdotter Larsson)",male,S.O.C. 14879,C123,S
freq,1,100,2,2,110

In [47]:
titanic_train.dtypes == 'object'

PassengerId    False
Survived       False
Pclass         False
Name            True
Sex             True
Age            False
SibSp          False
Parch          False
Ticket          True
Fare           False
Cabin           True
Embarked        True
dtype: bool

In [68]:
type(titanic_train.dtypes == 'object')

pandas.core.series.Series

In [70]:
a = titanic_train.dtypes == 'object'
a

PassengerId    False
Survived       False
Pclass         False
Name            True
Sex             True
Age            False
SibSp          False
Parch          False
Ticket          True
Fare           False
Cabin           True
Embarked        True
dtype: bool

In [71]:
type(a)

pandas.core.series.Series

In [52]:
titanic_train.dtypes[titanic_train.dtypes == 'object']

Name        object
Sex         object
Ticket      object
Cabin       object
Embarked    object
dtype: object

In [75]:
a = titanic_train.dtypes[titanic_train.dtypes == 'object'].index
print(a)

Index(['Name', 'Sex', 'Ticket', 'Cabin', 'Embarked'], dtype='object')

In [74]:
titanic_train[a].describe()

,Name,Sex,Ticket,Cabin,Embarked
count,156,156,156,31,155
unique,156,2,145,28,3
top,"Ahlin, Mrs. Johan (Johanna Persdotter Larsson)",male,S.O.C. 14879,C123,S
freq,1,100,2,2,110

In [76]:
float_datatypes = titanic_train.dtypes[titanic_train.dtypes == 'float64'].index
float_datatypes

Index(['Age', 'Fare'], dtype='object')

In [78]:
titanic_train[float_datatypes].describe()

              Age        Fare
count  126.000000  156.000000
mean    28.141508   28.109587
std     14.613880   39.401047
min      0.830000    6.750000
25%     19.000000    8.003150
50%     26.000000   14.454200
75%     35.000000   30.371850
max     71.000000  263.000000

In [79]:
titanic_train[float_datatypes]

      Age     Fare
0    22.0   7.2500
1    38.0  71.2833
2    26.0   7.9250
3    35.0  53.1000
4    35.0   8.0500
..    ...      ...
151  22.0  66.6000
152  55.5   8.0500
153  40.5  14.5000
154   NaN   7.3125
155  51.0  61.3792

[156 rows x 2 columns]

In [80]:
int_datatype = titanic_train.dtypes[titanic_train.dtypes == 'int64'].index
int_datatype

Index(['PassengerId', 'Survived', 'Pclass', 'SibSp', 'Parch'], dtype='object')

In [81]:
titanic_train[int_datatype]

     PassengerId  Survived  Pclass  SibSp  Parch
0              1         0       3      1      0
1              2         1       1      1      0
2              3         1       3      0      0
3              4         1       1      1      0
4              5         0       3      0      0
..           ...       ...     ...    ...    ...
151          152         1       1      1      0
152          153         0       3      0      0
153          154         0       3      0      2
154          155         0       3      0      0
155          156         0       1      0      1

[156 rows x 5 columns]

In [83]:
name = titanic_train['Name']
name

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
151                    Pears, Mrs. Thomas (Edith Wearne)
152                                     Meo, Mr. Alfonzo
153                      van Billiard, Mr. Austin Blyler
154                                Olsen, Mr. Ole Martin
155                          Williams, Mr. Charles Duane
Name: Name, Length: 156, dtype: object

In [84]:
name[0:100]

0                               Braund, Mr. Owen Harris
1     Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                Heikkinen, Miss. Laina
3          Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                              Allen, Mr. William Henry
                            ...
95                          Shorney, Mr. Charles Joseph
96                            Goldschmidt, Mr. George B
97                      Greenfield, Mr. William Bertram
98                 Doling, Mrs. John T (Ada Julia Bone)
99                                    Kantor, Mr. Sinai
Name: Name, Length: 100, dtype: object

In [85]:
name[100:0:-1]

100                              Petranec, Miss. Matilda
99                                     Kantor, Mr. Sinai
98                  Doling, Mrs. John T (Ada Julia Bone)
97                       Greenfield, Mr. William Bertram
96                             Goldschmidt, Mr. George B
                             ...
5                                       Moran, Mr. James
4                               Allen, Mr. William Henry
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
2                                 Heikkinen, Miss. Laina
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
Name: Name, Length: 100, dtype: object

In [92]:
print(type(titanic_train['Name']))
print(type(titanic_train[['Name']]))

<class 'pandas.core.series.Series'>
<class 'pandas.core.frame.DataFrame'>

In [94]:
titanic_train['Name']

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
151                    Pears, Mrs. Thomas (Edith Wearne)
152                                     Meo, Mr. Alfonzo
153                      van Billiard, Mr. Austin Blyler
154                                Olsen, Mr. Ole Martin
155                          Williams, Mr. Charles Duane
Name: Name, Length: 156, dtype: object

In [93]:
titanic_train[['Name']]

                                                  Name
0                              Braund, Mr. Owen Harris
1    Cumings, Mrs. John Bradley (Florence Briggs Th...
2                               Heikkinen, Miss. Laina
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                             Allen, Mr. William Henry
..                                                 ...
151                  Pears, Mrs. Thomas (Edith Wearne)
152                                   Meo, Mr. Alfonzo
153                    van Billiard, Mr. Austin Blyler
154                              Olsen, Mr. Ole Martin
155                        Williams, Mr. Charles Duane

[156 rows x 1 columns]

In [97]:
ticket_df = titanic_train[['Ticket']]
ticket_df

               Ticket
0           A/5 21171
1            PC 17599
2    STON/O2. 3101282
3              113803
4              373450
..                ...
151            113776
152        A.5. 11206
153          A/5. 851
154         Fa 265302
155          PC 17597

[156 rows x 1 columns]

In [98]:
type(ticket_df)

pandas.core.frame.DataFrame

In [99]:
titanic_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [100]:
titanic_train[['Fare', 'Pclass']].describe()

             Fare      Pclass
count  156.000000  156.000000
mean    28.109587    2.423077
std     39.401047    0.795459
min      6.750000    1.000000
25%      8.003150    2.000000
50%     14.454200    3.000000
75%     30.371850    3.000000
max    263.000000    3.000000

In [123]:
# sort values
df = titanic_train[['Survived', 'Pclass']].sort_values
df

<bound method DataFrame.sort_values of      Survived  Pclass
0           0       3
1           1       1
2           1       3
3           1       1
4           0       3
..        ...     ...
151         1       1
152         0       3
153         0       3
154         0       3
155         0       1

[156 rows x 2 columns]>

In [119]:
df.sort_values()

TypeError: sort_values() missing 1 required positional argument: 'by'

In [127]:
# find name starts with 'S'
name = titanic_train['Name']
name

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
151                    Pears, Mrs. Thomas (Edith Wearne)
152                                     Meo, Mr. Alfonzo
153                      van Billiard, Mr. Austin Blyler
154                                Olsen, Mr. Ole Martin
155                          Williams, Mr. Charles Duane
Name: Name, Length: 156, dtype: object

In [111]:
type(name)

pandas.core.series.Series

In [118]:
name[name.str.startswith('S')]

10                    Sandstrom, Miss. Marguerite Rut
12                     Saundercock, Mr. William Henry
23                       Sloper, Mr. William Thompson
31     Spencer, Mrs. William Augustus (Marie Eugenie)
48                                Samaan, Mr. Youssef
60                              Sirayanian, Mr. Orsen
63                              Skoog, Master. Harald
64                              Stewart, Mr. Albert A
76                                  Staneff, Mr. Ivan
81                        Sheerlinck, Mr. Jan Baptist
87                      Slocovski, Mr. Selman Francis
95                        Shorney, Mr. Charles Joseph
106                  Salkjelsvik, Miss. Anna Kristine
134                    Sobey, Mr. Samuel James Hayden
Name: Name, dtype: object

In [128]:
name = titanic_train['Name'][titanic_train['Name'].str.startswith('S')]
name

10                    Sandstrom, Miss. Marguerite Rut
12                     Saundercock, Mr. William Henry
23                       Sloper, Mr. William Thompson
31     Spencer, Mrs. William Augustus (Marie Eugenie)
48                                Samaan, Mr. Youssef
60                              Sirayanian, Mr. Orsen
63                              Skoog, Master. Harald
64                              Stewart, Mr. Albert A
76                                  Staneff, Mr. Ivan
81                        Sheerlinck, Mr. Jan Baptist
87                      Slocovski, Mr. Selman Francis
95                        Shorney, Mr. Charles Joseph
106                  Salkjelsvik, Miss. Anna Kristine
134                    Sobey, Mr. Samuel James Hayden
Name: Name, dtype: object

In [132]:
pd.Categorical(titanic_train['Pclass'])

[3, 1, 3, 1, 3, ..., 1, 3, 3, 3, 1]
Length: 156
Categories (3, int64): [1, 2, 3]

In [133]:
pd.Categorical(titanic_train['Name'])

[Braund, Mr. Owen Harris, Cumings, Mrs. John Bradley (Florence Briggs Th..., Heikkinen, Miss. Laina, Futrelle, Mrs. Jacques Heath (Lily May Peel), Allen, Mr. William Henry, ..., Pears, Mrs. Thomas (Edith Wearne), Meo, Mr. Alfonzo, van Billiard, Mr. Austin Blyler, Olsen, Mr. Ole Martin, Williams, Mr. Charles Duane]
Length: 156
Categories (156, object): [Ahlin, Mrs. Johan (Johanna Persdotter Larsson), Allen, Mr. William Henry, Andersson, Miss. Ellis Anna Maria, Andersson, Miss. Erna Alexandra, ..., Williams, Mr. Charles Eugene, Woolner, Mr. Hugh, Zabour, Miss. Hileni, van Billiard, Mr. Austin Blyler]

In [135]:
titanic_train['Cabin'].unique() # checking unique values in cabin

array([nan, 'C85', 'C123', 'E46', 'G6', 'C103', 'D56', 'A6',
       'C23 C25 C27', 'B78', 'D33', 'B30', 'C52', 'B28', 'C83', 'F33',
       'F G73', 'E31', 'A5', 'D10 D12', 'D26', 'C110', 'B58 B60', 'E101',
       'F E69', 'D47', 'B86', 'F2', 'C2'], dtype=object)

In [136]:
titanic_train['Pclass'].unique()

array([3, 1, 2], dtype=int64)

In [137]:
titanic_train['Age'].isnull()

0      False
1      False
2      False
3      False
4      False
       ...
151    False
152    False
153    False
154     True
155    False
Name: Age, Length: 156, dtype: bool

In [140]:
find_null_age = np.where(titanic_train['Age'].isnull()==True)
find_null_age

(array([  5,  17,  19,  26,  28,  29,  31,  32,  36,  42,  45,  46,  47,
         48,  55,  64,  65,  76,  77,  82,  87,  95, 101, 107, 109, 121,
        126, 128, 140, 154], dtype=int64),)

In [142]:
# finds data on row level
titanic_train.iloc[find_null_age]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
17,18,1,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,244373,13.0000,NaN,S
19,20,1,3,"Masselmani, Mrs. Fatima",female,NaN,0,0,2649,7.2250,NaN,C
26,27,0,3,"Emir, Mr. Farred Chehab",male,NaN,0,0,2631,7.2250,NaN,C
28,29,1,3,"O'Dwyer, Miss. Ellen ""Nellie""",female,NaN,0,0,330959,7.8792,NaN,Q
29,30,0,3,"Todoroff, Mr. Lalio",male,NaN,0,0,349216,7.8958,NaN,S
31,32,1,1,"Spencer, Mrs. William Augustus (Marie Eugenie)",female,NaN,1,0,PC 17569,146.5208,B78,C
32,33,1,3,"Glynn, Miss. Mary Agatha",female,NaN,0,0,335677,7.7500,NaN,Q
36,37,1,3,"Mamee, Mr. Hanna",male,NaN,0,0,2677,7.2292,NaN,C
42,43,0,3,"Kraeff, Mr. Theodor",male,NaN,0,0,349253,7.8958,NaN,C
45,46,0,3,"Rogers, Mr. William John",male,NaN,0,0,S.C./A.4. 23567,8.0500,NaN,S
46,47,0,3,"Lennon, Mr. Denis",male,NaN,1,0,370371,15.5000,NaN,Q
47,48,1,3,"O'Driscoll, Miss. Bridget",female,NaN,0,0,14311,7.7500,NaN,Q
48,49,0,3,"Samaan, Mr. Youssef",male,NaN,2,0,2662,21.6792,NaN,C
55,56,1,1,"Woolner, Mr. Hugh",male,NaN,0,0,19947,35.5000,C52,S
64,65,0,1,"Stewart, Mr. Albert A",male,NaN,0,0,PC 17605,27.7208,NaN,C
65,66,1,3,"Moubarek, Master. Gerios",male,NaN,1,1,2661,15.2458,NaN,C
76,77,0,3,"Staneff, Mr. Ivan",male,NaN,0,0,349208,7.8958,NaN,S
77,78,0,3,"Moutal, Mr. Rahamin Haim",male,NaN,0,0,374746,8.0500,NaN,S
82,83,1,3,"McDermott, Miss. Brigdet Delia",female,NaN,0,0,330932,7.7875,NaN,Q
87,88,0,3,"Slocovski, Mr. Selman Francis",male,NaN,0,0,SOTON/OQ 392086,8.0500,NaN,S
95,96,0,3,"Shorney, Mr. Charles Joseph",male,NaN,0,0,374910,8.0500,NaN,S
101,102,0,3,"Petroff, Mr. Pastcho (""Pentcho"")",male,NaN,0,0,349215,7.8958,NaN,S
107,108,1,3,"Moss, Mr. Albert Johan",male,NaN,0,0,312991,7.7750,NaN,S
109,110,1,3,"Moran, Miss. Bertha",female,NaN,1,0,371110,24.1500,NaN,Q
121,122,0,3,"Moore, Mr. Leonard Charles",male,NaN,0,0,A4. 54510,8.0500,NaN,S
126,127,0,3,"McMahon, Mr. Martin",male,NaN,0,0,370372,7.7500,NaN,Q
128,129,1,3,"Peter, Miss. Anna",female,NaN,1,1,2668,22.3583,F E69,C
140,141,0,3,"Boulos, Mrs. Joseph (Sultana)",female,NaN,0,2,2678,15.2458,NaN,C
154,155,0,3,"Olsen, Mr. Ole Martin",male,NaN,0,0,Fa 265302,7.3125,NaN,S

In [146]:
# row with maximum fare
max_fare_row = np.where(titanic_train['Fare'] == max(titanic_train['Fare']))
max_fare_row

(array([27, 88], dtype=int64),)

In [152]:
max_fare_row = titanic_train.iloc[max_fare_row]
max_fare_row

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
27,28,0,1,"Fortune, Mr. Charles Alexander",male,19.0,3,2,19950,263.0,C23 C25 C27,S
88,89,1,1,"Fortune, Miss. Mabel Helen",female,23.0,3,2,19950,263.0,C23 C25 C27,S

In [153]:
type(max_fare_row)

pandas.core.frame.DataFrame

In [166]:
# find name and age if fare and age is minimum
min_age_and_fare = np.where((titanic_train['Age'] == min(titanic_train['Age']) and 
                             (titanic_train['Fare'] == min(titanic_train['Fare']))))
min_age_and_fare

TypeError: Cannot perform 'rand_' with a dtyped [bool] array and scalar of type [bool]

In [169]:
# find name and age if fare and age is minimum
min_age_and_fare = titanic_train.iloc[np.where(titanic_train['Age'] == min(titanic_train['Age'])) and np.where(titanic_train['Fare'] == min(titanic_train['Fare']))]
min_age_and_fare

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
143,144,0,3,"Burke, Mr. Jeremiah",male,19.0,0,0,365222,6.75,NaN,Q

In [175]:
# find name and age if fare and age is minimum
b = (titanic_train['Age'] == min(titanic_train['Age'])) & (titanic_train['Fare'] == min(titanic_train['Fare']))
query_output = titanic_train.iloc[np.where(b)]
query_output
# min_age_and_fare = np.where(titanic_train['Age'] > 30 and titanic_train['Fare'] == min(titanic_train['Fare']))
# min_age_and_fare
# b

Empty DataFrame
Columns: [PassengerId, Survived, Pclass, Name, Sex, Age, SibSp, Parch, Ticket, Fare, Cabin, Embarked]
Index: []

In [161]:
type(titanic_train['Age'])

pandas.core.series.Series

In [177]:
min(titanic_train['Age'])

0.83